---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizes.GetCableTraySizesIterator
source: html/a0aabc61-8f85-c9eb-c3ce-0026f4e5758d.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizes.GetCableTraySizesIterator Method

Returns a CableTraySizeIterator to the MEP cable tray sizes.

## Syntax (C#)
```csharp
public CableTraySizeIterator GetCableTraySizesIterator()
```